import { FormatStyle } from './tlFormatter'

export const DEFAULT_FORMAT: FormatStyle = {
  // tl:
  //   'クランモード 5段階目 ワイルドグリフォン\n' +
  //   '29400244ダメージ\n' +
  //   'バトル時間 01:30\n' +
  //   'バトル日時 2021/07/23 19:37\n' +
  //   '----\n' +
  //   '◆パーティ編成\n' +
  //   'アカリ ★6 Lv205 RANK20\n' +
  //   'サレン（サマー） ★5 Lv205 RANK21\n' +
  //   'ネネカ ★5 Lv205 RANK21\n' +
  //   'キャル（ニューイヤー） ★4 Lv205 RANK21\n' +
  //   'ルナ ★3 Lv205 RANK21\n' +
  //   '----\n' +
  //   '◆ユニオンバースト発動時間\n' +
  //   '01:29 バトル開始\n' +
  //   '01:18 キャル（ニューイヤー）\n' +
  //   '01:17 アカリ\n' +
  //   '01:17 キャル（ニューイヤー）\n' +
  //   '01:17 ルナ\n' +
  //   '01:14 ネネカ\n' +
  //   '01:12 サレン（サマー）\n' +
  //   '01:11 ワイルドグリフォン\n' +
  //   '01:11 キャル（ニューイヤー）\n' +
  //   '01:11 キャル（ニューイヤー）\n' +
  //   '01:05 キャル（ニューイヤー）\n' +
  //   '01:05 ルナ\n' +
  //   '01:03 アカリ\n' +
  //   '01:03 キャル（ニューイヤー）\n' +
  //   '00:56 ワイルドグリフォン\n' +
  //   '00:54 サレン（サマー）\n' +
  //   '00:52 ネネカ\n' +
  //   '00:50 キャル（ニューイヤー）\n' +
  //   '00:50 キャル（ニューイヤー）\n' +
  //   '00:49 ルナ\n' +
  //   '00:46 アカリ\n' +
  //   '00:41 ワイルドグリフォン\n' +
  //   '00:36 ネネカ\n' +
  //   '00:35 キャル（ニューイヤー）\n' +
  //   '00:35 キャル（ニューイヤー）\n' +
  //   '00:33 ルナ\n' +
  //   '00:30 サレン（サマー）\n' +
  //   '00:30 アカリ\n' +
  //   '00:25 ワイルドグリフォン\n' +
  //   '00:19 キャル（ニューイヤー）\n' +
  //   '00:19 キャル（ニューイヤー）\n' +
  //   '00:19 ネネカ\n' +
  //   '00:18 ルナ\n' +
  //   '00:16 アカリ\n' +
  //   '00:11 ワイルドグリフォン\n' +
  //   '00:03 キャル（ニューイヤー）\n' +
  //   '00:02 キャル（ニューイヤー）\n' +
  //   '00:02 ワイルドグリフォン\n' +
  //   '00:02 ルナ\n' +
  //   '00:00 バトル終了\n',
  headerFormat:
    '<バトル日時>\n' +
    '<段階>段階目 <ボス名> <ダメージ>\n' +
    '<キャラ1名> <キャラ1星>/<キャラ1R>/<キャラ1専用LV> Lv<キャラ1LV> <キャラ1備考>\n' +
    '<キャラ2名> <キャラ2星>/<キャラ2R>/<キャラ2専用LV> Lv<キャラ2LV> <キャラ2備考>\n' +
    '<キャラ3名> <キャラ3星>/<キャラ3R>/<キャラ3専用LV> Lv<キャラ3LV> <キャラ3備考>\n' +
    '<キャラ4名> <キャラ4星>/<キャラ4R>/<キャラ4専用LV> Lv<キャラ4LV> <キャラ4備考>\n' +
    '<キャラ5名> <キャラ5星>/<キャラ5R>/<キャラ5専用LV> Lv<キャラ5LV> <キャラ5備考>\n\n' +
    '<開始秒数> バトル開始',
  selfUbFormat: '<UB使用時秒数> <UB使用キャラ名> <UB備考>',
  bossUbFormat: '\n-- <UB使用時秒数> ボス -- <UB備考>\n',
  footerFormat: '<終了秒数> バトル終了',
  nameConvs: {
    'ムイミ（ニューイヤー）': 'ニュイミ',
    'クウカ（オーエド）': 'オウカ',
    'サレン（クリスマス）': 'クリサレ',
    'ツムギ（ハロウィン）': 'ハロツム',
    'レイ（ニューイヤー）': 'ニュレイ',
    'リン（デレステ）': 'しぶりん',
    'ペコリーヌ（プリンセス）': 'プリペコ',
    'マコト（シンデレラ）': 'デレマコ',
    'コッコロ（ニューイヤー）': 'ニュコロ',
    'ヒヨリ（ニューイヤー）': 'ニュヨリ',
    'リマ（シンデレラ）': 'デレリマ',
    'ニノン（オーエド）': 'オノン',
    'マコト（サマー）': '水マコ',
    'ジュン（サマー）': '水ジュン',
    'クロエ（聖学祭）': '聖クロエ',
    'マツリ（ハロウィン）': 'ハロマツリ',
    'エリコ（バレンタイン）': 'バレエリコ',
    'アキノ（クリスマス）': 'クリアキノ',
    'アヤネ（クリスマス）': 'くりきち',
    'ルカ（サマー）': '水ルカ',
    'ヒヨリ（プリンセス）': 'プヨリ',
    'タマキ（サマー）': '水タマ',
    'ミソギ（ハロウィン）': 'ハロミソ',
    'チエル（聖学祭）': '聖チエル',
    'ペコリーヌ（サマー）': '水ペコ',
    'ペコリーヌ（ニューイヤー）': 'ニュペコ',
    'イリヤ（クリスマス）': 'クリヤ',
    'アンナ（サマー）': '水アンナ',
    'クリスティーナ（クリスマス）': 'クリクリ',
    クリスティーナ: 'クリス',
    'クルミ（クリスマス）': 'クリクルミ',
    'ミミ（ハロウィン）': 'ハロミミ',
    'ウヅキ（デレステ）': 'ウヅキ',
    'レイ（ハロウィン）': 'ハロレイ',
    'シズル（バレンタイン）': 'バズル',
    'マヒル（レンジャー）': '卍',
    'トモ（マジカル）': 'マジトモ',
    'ユカリ（クリスマス）': 'クリユカリ',
    'ノゾミ（クリスマス）': 'クリノゾミ',
    'リン（レンジャー）': 'ニュヨリ',
    'カオリ（サマー）': '水カオリ',
    'シノブ（ハロウィン）': 'ハロシノ',
    'ナナカ（サマー）': '水ナナカ',
    'ミフユ（サマー）': '水ミフユ',
    'アユミ（ワンダー）': 'ワユミ',
    'モニカ（マジカル）': 'マジモニ',
    'アカリ（エンジェル）': '天アカリ',
    'ヨリ（エンジェル）': '天ヨリ',
    'コッコロ（儀装束）': 'ギッコロ',
    'コッコロ（サマー）': '水コロ',
    'コッコロ（プリンセス）': 'プリコロ',
    ラビリスタ: 'ラビリ',
    'ネネカ（ニューイヤー）': 'ニュネカ',
    'ハツネ（サマー）': '水ハツネ',
    'ユイ（儀装束）': 'ギュイ',
    'サレン（サマー）': '水サレ',
    'ミヤコ（ハロウィン）': 'ハロミヤ',
    'マホ（シンデレラ）': 'デレマホ',
    'アオイ（編入生）': 'ヘオイ',
    'キャル（ニューイヤー）': 'ニャル',
    'ミオ（デレステ）': 'ミオ',
    'ミサト（サマー）': '水ミサト',
    'スズナ（サマー）': '水菜',
    'シオリ（マジカル）': 'マオリ',
    'スズメ（ニューイヤー）': 'ニュズメ',
    'カスミ（マジカル）': 'マジカス',
    'リノ（ワンダー）': 'ワリノ',
    'カスミ（サマー）': '水カス',
    'ユイ（ニューイヤー）': 'ニュイ',
    'キャル（プリンセス）': 'プリキャル',
    'ユイ（プリンセス）': 'プリユイ',
    'チカ（クリスマス）': 'クリチカ',
    'スズメ（サマー）': '水メ',
    'キャル（サマー）': '水キャル',
    'マホ（サマー）': '水マホ',
    'ミサキ（ハロウィン）': 'ハロミサ',
    'キョウカ（ハロウィン）': 'ハロキョ',
    'タマキ（作業服）': '作タマ',
    'アオイ（作業服）': 'サオイ',
    'カヤ（タイムトラベル）': 'カヤベル',
    'ミフユ（作業服）': 'サフユ',
    'レイ（プリンセス）': 'プリレイ',
    'エリコ（サマー）': '水エリコ',
    'シズル（サマー）': '水シズル',
    'ツムギ（サマー）': '水ツムギ',
    'ノゾミ（サマー）': '水ノゾミ',
  },
  startTime: 90,
  paddingName: 'none',
}
